app/views/applicants/show.html.slim

      th.padth Degree
    - @applicant.educations.each do |c|
---
SELECT `educations`.* FROM `educations` INNER JOIN `applicants_educations` ON `educations`.`id` = `applicants_educations`.`education_id` WHERE `applicants_educations`.`applicant_id` = 29

      th.padth Summary
    - @applicant.experiences.each do |c|
---
SELECT `experiences`.* FROM `experiences` INNER JOIN `applicants_experiences` ON `experiences`.`id` = `applicants_experiences`.`experience_id` WHERE `applicants_experiences`.`applicant_id` = 29

          h4
            = "#{c.user.first_name} #{c.user.last_name}"
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 58  ORDER BY `users`.`id` ASC LIMIT 1