app/controllers/applicants_controller.rb

  def index
    @applicants = Applicant.all
---
SELECT `applicants`.* FROM `applicants`

  def create
    @job = Job.find(params[:job_id])
    # @applicant = Education.new(params[:education])
    @applicant = @job.applicants.new(applicant_params)
    @applicant.status = "Candidate"
    # @applicant.education << education
    respond_to do |format|
      if @applicant.save
---
INSERT INTO `applicants` (`name`, `gender`, `email`, `headline`, `phone`, `address`, `photo`, `name_school`, `state_study`, `degree`, `company_name`, `industry`, `title`, `summary`, `resume`, `status`, `date_birth`, `created_at`, `updated_at`) VALUES ('Aditia Pratama', 'Man', 'adotcyber@gmail.com', 'im pro player for team liquid', '089614800388', 'jln rancabentang', '94_big.jpg', 'stm ', 'sopwer', 'bachelor', 'Voxel', 'gaming', 'surga dunia', 'im pro player', 'ruby_on_rails_tutorial_2nd_edition-preview.pdf', 'applied', '2016-09-14', '2016-09-14 02:49:21', '2016-09-14 02:49:21')

  def update
    respond_to do |format|
      if @applicant.update(applicant_params)
---
UPDATE `applicants` SET `resume` = 'Basic_Ruby.pdf', `updated_at` = '2016-09-14 09:09:07' WHERE `applicants`.`id` = 8

    def set_applicant
      @applicant = Applicant.find(params[:id])
---
SELECT  `applicants`.* FROM `applicants` WHERE `applicants`.`id` = 7 LIMIT 1