app/controllers/companies_controller.rb

INSERT INTO `companies` (`company_name`, `company_website`, `company_email`, `company_phone`, `industry`, `photo_company`, `created_at`, `updated_at`) VALUES ('hehe', 'hehe', 'hehehe@gmail.com', '0283928392', 'Airlines/Aviation', 'ruby.jpg', '2016-09-19 01:21:27', '2016-09-19 01:21:27')
---
  def create
    @company = Company.new(company_params)
    respond_to do |format|
      if @company.save

UPDATE `companies` SET `company_name` = 'Poison Papyrus', `company_website` = 'poison.com', `industry` = 'Advertising / Marketing / PR', `updated_at` = '2016-09-16 08:51:11' WHERE `companies`.`id` = 6
---
  def update
    respond_to do |format|
      if @company.update(company_params)

SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 6 LIMIT 1
---
    def set_company
      @company = Company.find(params[:id])