app/controllers/dashboards_controller.rb

SELECT `companies`.* FROM `companies` INNER JOIN `users` ON `users`.`company_id` = `companies`.`id` WHERE `companies`.`id` IS NULL
---
  def index
  	@companies = Company.joins(:users).where(id: current_user.company_id)