app/controllers/jobs_controller.rb

SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 16 LIMIT 1
---
  def new
    @company = Company.find(params[:company_id])

SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = NULL LIMIT 1
---
  def edit
    @company = Company.find(params[:company_id])

SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 16 LIMIT 1
---
    def set_company
      @company = Company.find(params[:company_id])

SELECT `experience_lists`.* FROM `experience_lists`
SELECT `function_lists`.* FROM `function_lists`
SELECT `applicant_employment_types`.* FROM `applicant_employment_types`
SELECT `employment_type_lists`.* FROM `employment_type_lists`
SELECT `industry_lists`.* FROM `industry_lists`
SELECT `education_lists`.* FROM `education_lists`
---
    def set_collection
      @experience_collection = ExperienceList.all.collect {|i| [i.experience, i.id]}
      @function_collection = FunctionList.all.collect {|i| [i.function, i.id]}
      @employment_type_collection = EmploymentTypeList.all.collect {|i| [i.employment_type, i.id]}
      @industry_collection = IndustryList.all.collect {|i| [i.industry, i.id]}
      @education_collection = EducationList.all.collect {|i| [i.education, i.id]}